import pandas as pd
import pytest

@pytest.fixture
def operations():
    return pd.DataFrame(
        [
            {
                "Номер карты": "*4052",
                "Сумма платежа": -1000.0,
            },
            {
                "Номер карты": "*4052",
                "Сумма платежа": -500.0,
            },
            {
                "Номер карты": "*7813",
                "Сумма платежа": -200.0,
            },
            {
                "Номер карты": "",
                "Сумма платежа": -300.0,
            },
            {
                "Номер карты": "*4052",
                "Сумма платежа": 1000.0,
            },
        ]
    )