from src.services import get_top_transactions

def test_get_top_transactions():
    operations = [
        {
            "Дата операции": "2026-06-16 10:00:00",
            "Сумма платежа": -100,
            "Категория": "Супермаркеты",
            "Описание": "Пятёрочка",
        },
        {
            "Дата операции": "2026-06-16 11:00:00",
            "Сумма платежа": -500,
            "Категория": "Переводы",
            "Описание": "Перевод",
        },
        {
            "Дата операции": "2026-06-16 12:00:00",
            "Сумма платежа": -50,
            "Категория": "Кафе",
            "Описание": "Кофе",
        },
    ]

    result = get_top_transactions(operations)

    assert result == [
        {
            "date": "2026-06-16 11:00:00",
            "amount": -500,
            "category": "Переводы",
            "description": "Перевод",
        },
        {
            "date": "2026-06-16 10:00:00",
            "amount": -100,
            "category": "Супермаркеты",
            "description": "Пятёрочка",
        },
        {
            "date": "2026-06-16 12:00:00",
            "amount": -50,
            "category": "Кафе",
            "description": "Кофе",
        },
    ]